import { subjectPederationTypes, onlyPovTypes } from 'api-types/tourism.types'
import { TAGS_NAME } from 'dic/tourism/TAGS_NAME'

export const TAGS_NAME_TO_POI_TYPE_MAPPING: Record<(typeof TAGS_NAME)[number], readonly any[]> = {
	'Все': [],

	'Иностранное': [],
	'Россия': [],

	'Субъекты федерации': subjectPederationTypes,
	'Республики': ['республика'],
	'Края': ['край'],
	'Области': ['область'],
	'Города федерального значения': ['город федерального значения'],
	'Автономные области': ['автономный область', 'автономный округ'],

	'Округа Москвы': ['административный округ Москвы', 'округ Москвы'],
	'Поселения Москвы': ['поселение Москвы'],
	'Районы Москвы': ['район Москвы'],
	'Станции метро Москвы': ['метро Москвы'],

	'Точки интереса': onlyPovTypes,
	'Вымершие города': ['вымерший город'],
	'Крепости': ['крепость'],
	'Каньоны': ['каньон'],
	'Парки': ['парк'],
	'Монастыри': ['монастырь'],
	'Каменоломни': ['каменоломни'],
	'Города': ['город'],
	'Деревни': ['деревня'],
	'ЗАТО': ['ЗАТО'],
} as const
