export const TAG_CATEGORY_MAP = {
	'Размер': [
		'грандиозный', 'большой', 'нормальный',
		// 'малый',
	],
	'Роль': [
		'менеджмент', 'дизайнер', 'разработчик', 'верстальщик', 'автор', 'музыкант',
	],
	'Агентство': [
		'Студия Лебедева', 'Эртоп', 'хомяк', 'Рамблер', 'SuperJob', 'Пересечения',
	],
	// 'Город': [
	//	 'Москва', 'Нижний Новгород', 'Интернет',
	// ],
	'Тип проекта': [
		'концепт', 'сайт', 'подпись электропочты', 'консультация', 'дизайн', 'документация',
		'паблик', 'сервис', 'раздел', 'гаджет', 'бот', 'автоматизация', 'опенсорс',
		// 'микросервис',
		'скрипт', 'выступление', 'итоги года', 'мероприятие', 'поддержка',
		'продукт', 'бизнес-процесс', 'подкаст', 'квалификация', 'исследование', 'проектирование',
	],
	// 'Технология': [
	//	 'Битрикс', 'имприматур', 'электропочта', 'фронтенд', 'Реакт', 'бекенд', 'фуллстек',
	//	 'физическое устройство', 'Вайзер', 'Вордпресс', 'Телеграм', 'Википедия', 'ВК',
	// ],
	'Продукт': [
		// 'A/B-тест',
		// 'бизнес-модель',
		'осознанность',
		// 'перфоманс',
		// 'синхронизация',
		'сценарий',
		// 'фрод',
		'оптимизация',
		// 'интерфейс — зло',
		'конверсия',
		// 'качество резюме',
	]
} as const;
