import { PortfolioCreditsType, PortfolioWorkerId } from 'api-types/portfolio.types'

const portfolioWorkerId = 1 as PortfolioWorkerId

export const credits: PortfolioCreditsType[] = [
	['Артемий Лебедев',      'худрук'],
	['Павел Герасимчук',     'арт-директор и дизайнер'],
	['Эркен Кагаров',        'тайный советник'],
	['Светлана Ярошевич',    'дизайнер'],
	['Анна Савельева',       'технический дизайнер'],
	['Мария Павлова',        'технический дизайнер'],
	['Зоригто Сансараймаев', 'технический дизайнер'],
	['Анастасия Шумакова',   'менеджер'],
	['Ангелина Загорская',   'менеджер'],
	['Егор Преженцев',       'менеджер'],
	['Татьяна Козлова',      'переводчик'],
	['Александр Носиков',    'редактор'],
	['Дмитрий Уткин',        'бэкендер'],
	['Олег Постоев',         'фронтендер'],
	['Дмитрий Муратов',      'бета-тестер'],
	['Станислав Щербаков',   'фотограф'],
	['Игорь Фаткин',         'фотограф'],
]
	.map(item => {
		return {
			role: item[1] as string,
			worker: {
				id: portfolioWorkerId, full_name: item[0] as string, company: '', image: null, login: 'login', role: 'few', link: '/',
			},
		}
	})
