import { PetProjectType } from "../../../types";

export const textProjects: PetProjectType[] = [
	{
		name: '🗣️ Лекция о вариативных шрифтах для СберДизайн Конф — 2021',
		description: 'Выступить с топами в шрифтах на сцене СБЕРа',
		priority: 1,
	},
	{
		name: '🗣️ Притча о Петре',
		description: 'Рассказать как не выгорать и успевать жизнь',
		priority: 2,
	},
	{
		name: 'Туризм',
		description: 'инструкция, как, где и какие впечатления получать от России',
		priority: 3,
	},
	{
		name: 'Нокиа',
		description: 'сервис мониторинга взаимоотношений с людьми (как планирование бюджета, только дружбы)',
		priority: 4,
	},
	{
		name: 'Инста-отношения',
		description: 'Серия постов как вести отношения с людьми',
		priority: 5,
	},
	{
		name: 'Концепт закона о высотности зданий в городе',
		description: 'Как сохранять историческое наследие',
		priority: 6,
	},
	{
		name: 'Серия дизайнов футболок',
		description: 'Есть идеи для футболок',
		priority: 6,
	},
	{
		name: 'Конструкторские бюро',
		description: 'архитектурная энциклопедия о взаимосвязи инженеров и архитекторов, почти без текста',
		priority: 6,
	},
	{
		name: 'Концепт цифрового государства',
		description: 'Цикл постов о том, каким могло быть цифровое государство',
		priority: 6,
	},
	{
		name: 'Концепт виджета айфона',
		description: 'У айфонов беда с виджетами, пора написать как можно использовать виджеты',
		priority: 6,
	},
	{
		name: 'Бот заданий',
		description: 'У айфонов беда с виджетами, пора написать как можно использовать виджеты',
		priority: 6,
	},
	{
		name: 'Хранитель процессов',
		description: 'Бот следящий за проектами, и актуализирующий сайт на основе действий в чате',
		priority: 6,
	},
	{
		name: 'Бот репостер',
		description: 'Бот публикующий репосты на хомяк',
		priority: 6,
	},
	{
		name: 'Бот упоминаний',
		description: 'Упоминать в телега-чате в стиле @all @react @design',
		priority: 6,
	},
	{
		name: 'Справочник демагога',
		description: 'О том как пользоваться приёмами и как разбивать чужую оборону нечестными методами. Раз все пользуются, овладей и ты',
		priority: 6,
	},
]