export const BAR_COLOR_MAPPING = {
	'Не посещал': '#F9FAFB',
	'Любимый': '#DC615C',
	'Хорошо': '#47935A',
	'Обычно': '#939EAA',
} as const
type BarMoodDictType = keyof typeof BAR_COLOR_MAPPING
type BarMoodColorType = typeof BAR_COLOR_MAPPING[keyof typeof BAR_COLOR_MAPPING]
export const barColor = (mood: BarMoodDictType): BarMoodColorType => BAR_COLOR_MAPPING[mood]

export const barTagsCategory = {
	'Алкоголь': {
		'пиво': 'пиво',
		'крафт': 'крафт',
		'сидр': 'сидр',
		'коктейли': 'коктейли',
		'настойки': 'настойки',
		'минту': 'минту',
		'вино': 'вино',
		'отличный крафт': 'отличный крафт',
	},
	'Еда': {
		'еда': 'еда',
		'бургер': 'бургер',
		'отличный бургер': 'отличный бургер',
		'рёбрышки': 'рёбрышки',
		'орешки': 'орешки',
	},
	'Прочее': {
		'музыка': 'музыка',
		'стендап': 'стендап',
		'ресторан': 'ресторан',
		'тусовка': 'тусовка',
		'интерьер': 'интерьер',
	}
} as const

type BarPovTagType = keyof typeof barTagsCategory['Алкоголь']
	| keyof typeof barTagsCategory['Еда']
	| keyof typeof barTagsCategory['Прочее']

const BAR_ICON_MAPPING = {
	'Бар/паб': 'islands#blueBarIcon',
	'Ресторан': 'islands#blueFoodIcon',
	'В сердечке': 'islands#blueHeartIcon',
} as const
type BarIconDictType = keyof typeof BAR_ICON_MAPPING
type BarIconColorType = typeof BAR_ICON_MAPPING[keyof typeof BAR_ICON_MAPPING]

export const barIcon = (barIconName: BarIconDictType): BarIconColorType => BAR_ICON_MAPPING[barIconName]


export type BarPovType = {
	title: string
	type: 'bar-pub' | 'bar' | 'restoran' | 'gastro-pub'
	adress?: string
	description?: string
	coord: [number, number]
	tags: BarPovTagType[]
	icon: BarIconDictType
	color: BarMoodDictType
}

export const barPovMoscow: BarPovType[] = [
	{
		title: 'Пока никто не видит',
		type: 'bar-pub',
		adress: 'ул. Покровка, 17, стр. 1, Москва',
		coord: [55.759815, 37.645264],
		tags: ['еда', 'бургер', 'отличный бургер', 'пиво', 'крафт', 'сидр', 'коктейли', 'музыка', 'стендап', 'орешки'],
		icon: 'Ресторан',
		color: 'Обычно',
	},
	{
		title: 'Dictatura Æstetica',
		type: 'bar-pub',
		adress: 'Берсеневская наб., 6, стр. 2, Москва',
		description: 'Отменные коктейли за 800',
		coord: [55.740528, 37.60881],
		tags: ['еда', 'ресторан', 'коктейли', 'интерьер'],
		icon: 'Бар/паб',
		color: 'Хорошо',
	},
	{
		title: 'Кабинет психолога',
		type: 'bar-pub',
		adress: 'Пятницкая ул., 30, стр. 1, Москва',
		coord: [55.740292, 37.628029],
		tags: ['пиво', 'крафт', 'коктейли'],
		icon: 'Бар/паб',
		color: 'Обычно',
	},
	{
		title: 'Южная рюмочная',
		type: 'bar-pub',
		adress: 'Большая Татарская ул., вл5, Москва',
		coord: [55.7425, 37.631316],
		tags: ['настойки', 'пиво', 'коктейли'],
		icon: 'Бар/паб',
		color: 'Хорошо',
	},
	{
		title: 'Моряк и Чайка',
		type: 'bar-pub',
		adress: 'Пятницкая ул., 25, стр. 1Д, Москва',
		coord: [55.741491, 37.628715],
		tags: ['пиво', 'коктейли', 'настойки', 'интерьер'],
		icon: 'Бар/паб',
		color: 'Обычно',
	},
	{
		title: 'Птица-Синица',
		type: 'bar',
		adress: 'Посидеть под митол во впечатляющем месте',
		coord: [55.756385, 37.635254],
		tags: ['пиво', 'крафт', 'коктейли', 'еда', 'интерьер'],
		icon: 'В сердечке',
		color: 'Любимый',
	},
	{
		title: 'Слёзы Берёзы',
		type: 'bar-pub',
		adress: 'Бауманская ул., 15, Москва',
		coord: [55.775646, 37.677753],
		tags: ['вино', 'еда', 'коктейли', 'крафт', 'музыка', 'пиво', 'сидр', 'интерьер'],
		icon: 'В сердечке',
		color: 'Любимый',
	},
	{
		title: 'Bobёёr',
		type: 'bar-pub',
		description: 'Ненамоленный бар для одиночек, тестенько, но разместиться оч можно, проводят стендапы',
		coord: [55.776346, 37.677244],
		tags: ['стендап', 'крафт', 'пиво', 'сидр'],
		icon: 'Бар/паб',
		color: 'Обычно',
	},
	{
		title: 'Волковская пивоварня',
		type: 'bar-pub',
		adress: 'Нижний Сусальный пер., 5, стр. 7, Москва',
		coord: [55.759252, 37.663313],
		tags: ['бургер', 'еда', 'крафт', 'пиво', 'сидр'],
		icon: 'Бар/паб',
		color: 'Обычно',
	},
	// Токийсую ещё добавить
	{
		title: 'Дом в Котором',
		type: 'bar-pub',
		description: 'Пиздатейший интерьер, редко есть места, на любой вкус по одному: вишнёвое, пшеничка, лагер, стаут',
		coord: [55.758561, 37.645409],
		tags: ['еда', 'крафт', 'музыка', 'пиво', 'интерьер'],
		icon: 'В сердечке',
		color: 'Любимый',
	},
	{
		title: 'Зинзивер',
		type: 'bar-pub',
		adress: 'Покровский бул., 2/14, Москва',
		coord: [55.758817, 37.645529],
		tags: ['коктейли', 'настойки', 'тусовка', 'пиво'],
		icon: 'Бар/паб',
		color: 'Хорошо',
	},
	{
		title: 'Сионист',
		type: 'bar-pub',
		adress: 'ул. Покровка, 2/1с1, Москва',
		coord: [55.757881, 37.639171],
		tags: ['еда', 'интерьер', 'коктейли', 'крафт', 'музыка', 'настойки', 'пиво', 'сидр', 'тусовка'],
		icon: 'В сердечке',
		color: 'Любимый',
	},
	{
		title: 'Right Hops',
		type: 'bar',
		description: 'Беспрецедентный крафт',
		coord: [55.764516, 37.568285],
		tags: ['орешки', 'тусовка', 'бургер', 'еда', 'крафт', 'отличный крафт', 'музыка', 'пиво', 'сидр'],
		icon: 'В сердечке',
		color: 'Любимый',
	},
	{
		title: 'Дорогая, я перезвоню',
		type: 'bar-pub',
		adress: 'Бар, паб; </br>\nПятницкий пер., 2, Москва',
		coord: [55.743475, 37.629784],
		tags: ['коктейли', 'музыка'],
		icon: 'Бар/паб',
		color: 'Обычно',
	},
	{
		title: 'Алёша и Графин',
		type: 'bar-pub',
		coord: [55.74342809535701, 37.65197260347266],
		tags: ['бургер', 'еда', 'крафт', 'настойки', 'пиво'],
		icon: 'Бар/паб',
		color: 'Хорошо',
	},
	// los banditos добавить
	{
		title: 'Кот Шрёдингера',
		type: 'bar-pub',
		adress: 'ул. Большая Дмитровка, 32, Москва',
		coord: [55.765389, 37.611286],
		tags: ['интерьер', 'коктейли', 'музыка', 'тусовка'],
		icon: 'В сердечке',
		color: 'Любимый',
	},
	// Счастье на крыше
	{
		title: 'Петров и Васечка',
		type: 'bar-pub',
		adress: 'Цветной бул., 24, корп. 1, Москва',
		coord: [55.770989, 37.622369],
		tags: ['бургер', 'рёбрышки', 'еда', 'коктейли', 'крафт', 'музыка', 'настойки', 'пиво', 'сидр', 'тусовка'],
		icon: 'В сердечке',
		color: 'Любимый',
	},
	{
		// Закрыт же
		title: 'Герои',
		type: 'bar-pub',
		adress: 'Трубная ул., 21, Москва',
		coord: [55.770798, 37.625227],
		tags: ['бургер', 'еда', 'крафт', 'сидр'],
		icon: 'Бар/паб',
		color: 'Хорошо',
	},
	// Волчья стая
	{
		title: 'Варка',
		type: 'bar-pub',
		adress: 'Цветной бул., 7, стр. 1, Москва',
		coord: [55.769237, 37.620841],
		tags: ['минту', 'бургер', 'еда', 'крафт', 'музыка', 'пиво', 'сидр'],
		icon: 'Бар/паб',
		color: 'Хорошо',
	},
	{
		title: 'Варка',
		type: 'bar-pub',
		coord: [55.742073901912896, 37.65525562730684],
		tags: ['минту', 'бургер', 'еда', 'крафт', 'музыка', 'пиво', 'сидр'],
		icon: 'Бар/паб',
		color: 'Хорошо',
	},
	// И в остальных местах добавить
	{
		title: 'Burger Heroes',
		type: 'gastro-pub',
		adress: 'Пушкинская площадь, 2/1, Москва',
		coord: [55.76611468721391, 37.60796059391747],
		tags: ['бургер', 'еда', 'крафт', 'отличный бургер', 'пиво', 'сидр'],
		icon: 'Бар/паб',
		color: 'Хорошо',
	},
	// Не посещал
	{
		title: 'Галки',
		type: 'restoran',
		adress: 'Только через бронь, клёвая еда',
		coord: [55.764918176147184, 37.60869565664351],
		tags: ['еда', 'ресторан'],
		icon: 'Ресторан',
		color: 'Не посещал',
	},
	{
		title: 'Лофт кафе 24 часа',
		type: 'gastro-pub',
		adress: 'Поесть, годное пиво',
		coord: [55.740638613069905, 37.60877008794348],
		tags: ['еда', 'коктейли', 'пиво', 'ресторан', 'сидр'],
		icon: 'Бар/паб',
		color: 'Обычно',
	},
	{
		title: 'Black Swan pub&shop',
		type: 'gastro-pub',
		coord: [55.754466, 37.637835],
		description: 'В подвале ещё 3 бара',
		tags: ['бургер', 'еда', 'интерьер', 'коктейли', 'крафт', 'настойки', 'пиво', 'ресторан', 'сидр'],
		icon: 'В сердечке',
		color: 'Любимый',
	},
	{
		title: 'Пестики-Тычинки',
		type: 'bar-pub',
		adress: 'Можно пофоткать, годные настойки',
		coord: [55.756425477341175, 37.63527818425651],
		tags: ['настойки', 'интерьер', 'тусовка'],
		icon: 'Бар/паб',
		color: 'Хорошо',
	},
	{
		title: 'Сентябрь',
		type: 'bar-pub',
		adress: 'Ебовейшая настойка на вишне. Отлично для свидания',
		coord: [55.75877399132454, 37.64742226822237],
		tags: ['вино', 'настойки'],
		icon: 'В сердечке',
		color: 'Любимый',
	},
	{
		title: 'Рюмочная Свобода',
		type: 'bar-pub',
		coord: [55.762526, 37.637411],
		tags: ['настойки', 'тусовка', 'коктейли', 'музыка', 'тусовка'],
		icon: 'В сердечке',
		color: 'Любимый',
	},
	{
		title: 'Широкую на широкую',
		type: 'bar-pub',
		adress: 'Неплохие настойки, серпска плескавица, хорошее пиво',
		coord: [55.76154148327703, 37.636153180896926],
		tags: ['еда', 'коктейли', 'крафт', 'музыка', 'настойки', 'пиво', 'сидр'],
		icon: 'Ресторан',
		color: 'Хорошо',
	},
	{
		title: 'Beermood',
		type: 'bar-pub',
		adress: 'Пиво в асортименте, есть хорошее, но в основном для шумной большой компании, есть подвал',
		coord: [55.76045712495462, 37.646463592349924],
		tags: ['бургер', 'еда', 'крафт', 'пиво'],
		icon: 'Бар/паб',
		color: 'Обычно',
	},
]