import { HigimoMapPoint } from './types';

export const moscowPovPoints: HigimoMapPoint[] = [
	{
		coord: [55.75640433092673, 37.64335270916685],
		title: "Магазин Гиперион",
		color: "#1e98ff",
	},
	{
		coord: [55.764602, 37.936214],
		title: "старые автозаправки на Аэропорту",
		color: "#1e98ff",
	},
	{
		coord: [55.722575829172435, 37.513489938871814],
		title: "Дом-кольцо?",
		color: "#1e98ff"
	},
	{
		coord: [55.73865565400293, 37.52327463735815],
		title: "Панорама бородинской битвы",
		color: "#1e98ff"
	},
	{
		coord: [55.854254, 37.763432],
		title: "национальный парк Лосиный остров",
		color: "#1e98ff"
	},
	{
		coord: [55.74978223733394, 37.537933323699605],
		title: "Смотровую площадку в башне «Федерация. Восток» на 89 этаже",
		color: "#1e98ff"
	},
	{
		coord: [55.81968283272281, 37.61164042742853],
		title: "Смотровая в Останкинской башне",
		color: "#1e98ff"
	},
	{
		coord: [55.693662, 37.349749],
		title: "Сколково",
		color: "#1e98ff"
	},
	{
		coord: [55.78957114031782, 37.656084282074374],
		title: "Красивый лофт",
		color: "#1e98ff"
	},
	{
		coord: [55.790326753739016, 37.661277038727206],
		title: "Красивое место",
		color: "#1e98ff"
	},
	{
		coord: [55.710915975397796, 37.59917321148662],
		title: "Интересный замок",
		color: "#1e98ff"
	},
	{
		coord: [55.7145319668839, 37.6021450990751],
		title: "Монастырь-кремль",
		color: "#1e98ff"
	},
	{
		coord: [55.74799875193313, 37.58949580136077],
		title: "Дом Мельникова",
		color: "#1e98ff"
	},
	{
		coord: [55.7468420178569, 37.58561196270701],
		title: "Застенки МИДа",
		color: "#1e98ff"
	},
	{
		coord: [55.74390989550519, 37.585370563895644],
		title: "Красивое граффити",
		color: "#1e98ff"
	},
	{
		coord: [55.774377788360184, 37.58695839134027],
		title: "unknown",
		color: "#1e98ff"
	},
	{
		coord: [55.77314411258291, 37.5954770871715],
		title: "Красивые дома",
		color: "#1e98ff"
	},
	{
		coord: [55.770859589321496, 37.59680747362917],
		title: "Клёвый бар",
		color: "#1e98ff"
	},
	{
		coord: [55.744704, 37.605567],
		title: "Храм Христа Спасителя",
		color: "#1e98ff"
	},
	{
		coord: [55.741206, 37.588916],
		title: "Пофоткать",
		color: "#1e98ff"
	},
	{
		coord: [55.860537, 37.79474],
		title: "Лосиный Остров",
		color: "#1e98ff"
	},
	{
		coord: [55.769101, 37.583227],
		title: "Тишинка",
		color: "#1e98ff"
	},
	{
		coord: [55.735099, 37.807414],
		title: "Государственный музей керамики и Усадьба Кусково XVIII века",
		color: "#1e98ff"
	},
	{
		coord: [55.738317529274426, 37.50676343389825],
		title: "Красивое здание",
		color: "#1e98ff"
	},
	{
		coord: [55.761674, 37.745466],
		title: "улица Уткина",
		color: "#1e98ff"
	},
	{
		coord: [55.76040953361664, 37.696510321057495],
		title: "unknown",
		color: "#1e98ff"
	},
	{
		coord: [55.76524884019247, 37.690931326306504],
		title: "unknown",
		color: "#1e98ff"
	},
	{
		coord: [55.757699258446635, 37.69324875489533],
		title: "unknown",
		color: "#1e98ff"
	},
	{
		coord: [55.749572, 37.55646],
		title: "Бадаевский пивоваренный завод",
		color: "#1e98ff"
	},
	{
		coord:[55.719009, 37.447234],
		title: "деревянные дома",
		color: "#1e98ff"
	},
	{
		coord:[55.76725046035027, 37.6166483029014],
		title: "Монастырь",
		color: "#1e98ff"
	},
	{
		coord:[55.79346576128725, 37.552112504684445],
		title: "Путевой дворец",
		color: "#1e98ff"
	},
	{
		coord:[55.73465796873318, 37.65389697238145],
		title: "Очень красивый и ухоженный район",
		color: "#1e98ff"
	},
	{
		coord:[55.79384050963582, 37.59754912539658],
		title: "Отфоткать церковь",
		color: "#1e98ff"
	},
	{
		coord:[55.78820681200711, 37.621367141448694],
		title: "Отфоткать церковь",
		color: "#1e98ff"
	},
	{
		coord:[55.791108389361625, 37.618534728728974],
		title: "Посетить парк",
		color: "#1e98ff"
	},
	{
		coord:[55.75184616781763, 37.61595980807455],
		title: "Колокольня Ивана Великого",
		color: "#1e98ff"
	},
	{
		coord:[55.75991110559217, 37.61871711894134],
		title: "Посетить Большой",
		color: "#1e98ff"
	},
	{
		coord:[55.75967517094906, 37.62040154620269],
		title: "Посетить Малый",
		color: "#1e98ff"
	},
	{
		coord:[55.75815063562118, 37.61553065463165],
		title: "Посетить Госдуму",
		color: "#1e98ff"
	},
	{
		coord:[55.756160179969356, 37.61855618640045],
		title: "Музей войны",
		color: "#1e98ff"
	},
	{
		coord:[55.71825111636683, 37.58833740777537],
		title: "Ванный домик",
		color: "#1e98ff"
	},
	{
		coord:[55.72055235736677, 37.593551622100314],
		title: "Александринский дворец",
		color: "#1e98ff"
	},
	{
		coord:[55.723290472589674, 37.564018086256425],
		title: "как тут во внуктреннем дворе?",
		color: "#1e98ff"
	},
	{
		coord:[55.75112, 37.65712],
		title: "Берлинская стена",
		color: "#1e98ff"
	},
	{
		coord:[55.75452192841659, 37.64002896415651],
		title: "Монастырь",
		color: "#1e98ff"
	},
	{
		coord:[55.75671817142565, 37.64075852500846],
		title: "Органный собор",
		color: "#1e98ff"
	},
	{
		coord:[55.78478876597885, 37.70739925988861],
		title: "Прикольный лофт",
		color: "#1e98ff"
	},
	{
		coord:[55.75909991485, 37.58088333836192],
		title: "Сталинская высотка",
		color: "#1e98ff"
	},
	{
		coord:[55.75501009266094, 37.572922542005685],
		title: "Дом правительства",
		color: "#1e98ff"
	},
	{
		coord:[55.71387320808507, 37.46924108740227],
		title: "Долина реки",
		color: "#1e98ff"
	},
	{
		coord:[55.765546380972296, 37.629546290789804],
		title: "Монастырь",
		color: "#1e98ff"
	},
	{
		coord:[55.749836, 37.552885],
		title: "Россия, Москва, набережная Тараса Шевченко",
		color: "#1e98ff"
	},
	{
		coord:[55.83843428744319, 37.61438225643917],
		title: "Главтабак",
		color: "#1e98ff"
	},
	{
		coord:[55.84235836548215, 37.633694161346384],
		title: "Леоновская роща",
		color: "#1e98ff"
	},
	{
		coord:[55.83391808563082, 37.612386692930166],
		title: "Экотропа (не знаю где она)",
		color: "#1e98ff"
	},
	{
		coord:[55.834594342941514, 37.612987507751335],
		title: "Павильон Физкультура",
		color: "#1e98ff"
	},
	{
		coord:[55.781071, 37.440163],
		title: "Серебряный бор",
		color: "#1e98ff"
	},
	{
		coord:[55.62318212654649, 37.53861511904898],
		title: "Красивые незастроенные места",
		color: "#1e98ff"
	},
	{
		coord:[55.848548429023545, 37.39767345767146],
		title: "Усадьба Братцево",
		color: "#1e98ff"
	},
	{
		coord:[55.784558, 37.284041],
		title: "Музей-усадьба Архангельское",
		color: "#1e98ff"
	},
	{
		coord:[55.58852423019414, 37.85039775665246],
		title: "Красивая старая церковь, рощи и поймы",
		color: "#1e98ff"
	},
	{
		coord:[55.59391957826667, 37.863036325530615],
		title: "Копыто!",
		color: "#1e98ff"
	},
	{
		coord:  [55.653055, 37.593057],
		title: "Locus Solus. Кладовая тишины\nРоссия, Москва, Малая Юшуньская улица, 1к2\n\nhttps://vk.com/locus_solus",
		color: "#1e98ff",
	},
	{
		coord: [36.82149,55.579007],
		title: "Главный храм Вооружённых Сил России, там вязь Виктора\n\nПравославный храм",
		color: "#1e98ff",
	},
	{
		coord: [55.74735354455678, 37.63932602394195],
		title: "Красивая решётка моста красная с чёткими звёздами и колхозниками справа и прекрасный вид",
		color: "#1e98ff",
	},
	{
		coord: [55.737161407675785, 37.64798419464192],
		title: "Красивая решётка моста красная с чёткими звёздами и колхозниками справа и прекрасный вид",
		color: "#1e98ff",
	},
	{
		coord: [55.72913412631907, 37.65523688781819],
		title: "Красивая решётка моста красная с чёткими звёздами и колхозниками справа и прекрасный вид",
		color: "#1e98ff",
	},
	{
		coord: [55.803069, 37.502408],
		title: "Россия, Москва, Северный административный округ, район Сокол, кооперативный жилой посёлок Сокол",
		color: "#1e98ff",
	},
]