type RussiaCityPointType = {
	coord: [number, number];
	title: string;
	description?: string;
	color: `#${string}`;
}
export const russiaCity: RussiaCityPointType[] = [
	{
		coord: [50.31497490162175, 87.59996710796115],
		title: "Акташ",
		color: "#b3b3b3"
	},
	{
		coord: [44.4207391422258, 34.05326958690579],
		title: "Алупка",
		color: "#b3b3b3"
	},
	{
		coord: [44.68595475167452, 34.41424202193341],
		title: "Алушта",
		color: "#b3b3b3"
	},
	{
		coord: [54.91107819641525, 52.28901367187436],
		title: "Альметьевск",
		color: "#1e98ff"
	},
	{
		coord: [44.894651465382736, 37.32307549510852],
		title: "Анапа",
		color: "#b3b3b3"
	},
	{
		coord: [57.7408643235249, 46.19112311382339],
		title: "Андрианово",
		color: "#b3b3b3"
	},
	{
		coord: [45.00681994120542, 41.120786539713635],
		title: "Армавир",
		color: "#1e98ff"
	},
	{
		coord: [51.79366782172442, 87.26479826945915],
		title: "Артыбаш",
		color: "#b3b3b3"
	},
	{
		coord: [46.35615857114744, 48.038639322916836],
		title: "Астрахань",
		color: "#1e98ff"
	},
	{
		coord: [53.350093425271965, 83.78722222222127],
		title: "Барнаул",
		color: "#b3b3b3"
	},
	{
		coord: [47.140830052721796, 39.75411987304666],
		title: "Батайск",
		color: "#1e98ff"
	},
	{
		coord: [60.010185443733626, 37.77900811229893],
		title: "Белозерск",
		color: "#1e98ff"
	},
	{
		coord: [54.75, 83.1],
		title: "Бердск",
		color: "#1e98ff"
	},
	{
		coord: [52.516666666667, 85.166666666667],
		title: "Бийск",
		color: "#b3b3b3"
	},
	{
		coord: [55.05383620965006, 55.96685384114499],
		title: "Благовещенск",
		color: "#1e98ff"
	},
	{
		coord: [57.758118603004846, 46.44518195171413],
		title: "Большая музя",
		color: "#b3b3b3"
	},
	{
		coord: [57.63661254891203, 46.57152472515138],
		title: "Большие кулики",
		color: "#b3b3b3"
	},
	{
		coord: [57.6375331930167, 46.21378241558124],
		title: "Большое широкое",
		color: "#b3b3b3"
	},
	{
		coord: [56.10532016566874, 101.62765299479473],
		title: "Братск",
		color: "#1e98ff"
	},
	{
		coord: [53.25658873999927, 34.36941324869777],
		title: "Брянск",
		color: "#e6761b"
	},
	{
		coord: [57.96087659097582, 46.682761297417485],
		title: "Вахтан",
		color: "#1e98ff"
	},
	{
		coord: [58.52424793223664, 31.258622370115333],
		title: "Великий Новгород",
		color: "#b3b3b3"
	},
	{
		coord: [57.851868419309184, 45.79717868381049],
		title: "Ветлуга",
		color: "#b3b3b3"
	},
	{
		coord: [45.003082917556085, 37.28086768169792],
		title: "Витязево",
		color: "#b3b3b3"
	},
	{
		coord: [43.116666666667, 131.9],
		title: "Владивосток",
		color: "#1e98ff"
	},
	{
		coord: [43.028527261450556, 44.678422174800296],
		title: "Владикавказ",
		color: "#b3b3b3"
	},
	{
		coord: [56.133333333333, 40.416666666667],
		title: "Владимир",
		color: "#b3b3b3"
	},
	{
		coord: [48.6819260985214, 44.49714776073822],
		title: "Волгоград",
		color: "#1e98ff"
	},
	{
		coord: [47.5152711405744, 42.16304626464809],
		title: "Волгодонск",
		color: "#1e98ff"
	},
	{
		coord: [59.224001051101006, 39.885636530271526],
		title: "Вологда",
		color: "#1e98ff"
	},
	{
		coord: [59.91102365487433, 32.318803034174294],
		title: "Волхов",
		color: "#1e98ff"
	},
	{
		coord: [60.713521899218016, 28.74824639354894],
		title: "Выборг",
		color: "#b3b3b3"
	},
	{
		coord: [55.32831186052289, 42.16619723849784],
		title: "Выкса",
		color: "#1e98ff"
	},
	{
		coord: [51.97839484435118, 85.92659112011513],
		title: "Горно-Алтайск",
		color: "#b3b3b3"
	},
	{
		coord: [43.32067747156171, 45.69794006347642],
		title: "Грозный",
		color: "#b3b3b3"
	},
	{
		coord: [55.81057570786032, 44.09724055309468],
		title: "Дальнее Константиново",
		color: "#b3b3b3"
	},
	{
		coord: [42.0742826100622, 48.29308675130161],
		title: "Дербент",
		color: "#b3b3b3"
	},
	{
		coord: [56.24556946474635, 43.4747192382807],
		title: "Дзержинск",
		color: "#1e98ff"
	},
	{
		coord: [54.22206855077803, 49.59706624348838],
		title: "Димитровград",
		color: "#1e98ff"
	},
	{
		coord: [55.433333333333, 37.75],
		title: "Домодедово",
		color: "#1e98ff"
	},
	{
		coord: [45.2, 33.358333333333],
		title: "Евпатория",
		color: "#1e98ff"
	},
	{
		coord: [56.84236596418754, 60.60942586262952],
		title: "Екатеринбург",
		color: "#b3b3b3"
	},
	{
		coord: [52.62836710435699, 38.50374552408834],
		title: "Елец",
		color: "#1e98ff"
	},
	{
		coord: [44.049989230285156, 42.85963792588916],
		title: "Ессентуки",
		color: "#1e98ff"
	},
	{
		coord: [56.25305806396503, 93.516853841145],
		title: "Железногорск",
		color: "#1e98ff"
	},
	{
		coord: [52.333333333333, 35.366666666667],
		title: "Железногорск",
		color: "#1e98ff"
	},
	{
		coord: [55.98445083670249, 37.21870537792322],
		title: "Зеленоград",
		color: "#b3b3b3"
	},
	{
		coord: [55.1760991839143, 59.68039957682293],
		title: "Златоуст",
		color: "#1e98ff"
	},
	{
		coord: [57.00599505987377, 40.98058675130118],
		title: "Иваново",
		color: "#1e98ff"
	},
	{
		coord: [56.85, 53.216666666667],
		title: "Ижевск",
		color: "#1e98ff"
	},
	{
		coord: [52.2833333333229, 104.28352050781184],
		title: "Иркутск",
		color: "#1e98ff"
	},
	{
		coord: [56.632777777778, 47.895833333333],
		title: "Йошкар Ола",
		color: "#b3b3b3"
	},
	{
		coord: [55.790833333333, 49.114444444444],
		title: "Казань",
		color: "#b3b3b3"
	},
	{
		coord: [54.70871564048393, 20.50137329101552],
		title: "Калининград",
		color: "#b3b3b3"
	},
	{
		coord: [54.533333333333, 36.266666666667],
		title: "Калуга",
		color: "#e6761b"
	},
	{
		coord: [55.5010522900309, 47.49092217479889],
		title: "Канаш",
		color: "#b3b3b3"
	},
	{
		coord: [42.88838266385114, 47.625093587238815],
		title: "Каспийск",
		color: "#b3b3b3"
	},
	{
		coord: [55.36150524589209, 86.10511881510392],
		title: "Кемерово",
		color: "#1e98ff"
	},
	{
		coord: [45.338611111111, 36.468055555556],
		title: "Керчь",
		color: "#1e98ff"
	},
	{
		coord: [57.309601003861914, 47.21216498393973],
		title: "Кикнур",
		color: "#b3b3b3"
	},
	{
		coord: [56.781624115260556, 46.86266242046284],
		title: "Килемары",
		color: "#1e98ff"
	},
	{
		coord: [58.603583849546865, 49.66510620117166],
		title: "Киров",
		color: "#b3b3b3"
	},
	{
		coord: [43.90751789609628, 42.71862670898434],
		title: "Кисловодск",
		color: "#1e98ff"
	},
	{
		coord: [56.37579906066014, 41.29500298394032],
		title: "Ковров",
		color: "#1e98ff"
	},
	{
		coord: [55.106211685109926, 38.756791315423335],
		title: "Коломна",
		color: "#b3b3b3"
	},
	{
		coord: [50.56399742677697, 136.9999999999992],
		title: "Комсомольск-на-Амуре",
		color: "#1e98ff"
	},
	{
		coord: [51.09664285853601, 87.8972846128437],
		title: "Коо",
		color: "#b3b3b3"
	},
	{
		coord: [55.11259730514322, 61.61117350260384],
		title: "Копейск",
		color: "#1e98ff"
	},
	{
		coord: [51.70720415172236, 87.68485365886363],
		title: "Корбу",
		color: "#b3b3b3"
	},
	{
		coord: [57.769602044809496, 40.93607991536421],
		title: "Кострома",
		color: "#1e98ff"
	},
	{
		coord: [50.01328087512739, 88.66564093608609],
		title: "Кош-Агач",
		color: "#b3b3b3"
	},
	{
		coord: [57.755182288209696, 46.276267156792386],
		title: "Красногор",
		color: "#b3b3b3"
	},
	{
		coord: [45.04696440639915, 38.99981282552036],
		title: "Краснодар",
		color: "#b3b3b3"
	},
	{
		coord: [56.02435809334349, 92.86392008463451],
		title: "Красноярск",
		color: "#1e98ff"
	},
	{
		coord: [57.655941152693416, 46.67452155132321],
		title: "Красный кирпичник",
		color: "#b3b3b3"
	},
	{
		coord: [56.14968797285868, 44.207404241754304],
		title: "Кстово",
		color: "#b3b3b3"
	},
	{
		coord: [55.440833333333, 65.341111111111],
		title: "Курган",
		color: "#1e98ff"
	},
	{
		coord: [51.73542929072426, 36.18607991536367],
		title: "Курск",
		color: "#1e98ff"
	},
	{
		coord: [51.716666666667, 94.45],
		title: "Кызыл",
		color: "#1e98ff"
	},
	{
		coord: [43.90837413217063, 39.332564459041784],
		title: "Лазаревское",
		color: "#b3b3b3"
	},
	{
		coord: [66.50265298084032, 66.59065362011346],
		title: "Салехард",
		color: "#1e98ff"
	},
	{
		coord: [52.62418873745187, 39.59725341796845],
		title: "Липецк",
		color: "#b3b3b3"
	},
	{
		coord: [57.66274972275892, 46.54131232280765],
		title: "Лужайки",
		color: "#1e98ff"
	},
	{
		coord: [53.383333333333, 59.033333333333],
		title: "Магнитогорск",
		color: "#1e98ff"
	},
	{
		coord: [42.983333333333, 47.483333333333],
		title: "Махачкала",
		color: "#b3b3b3"
	},
	{
		coord: [57.643056564940224, 46.61444006938968],
		title: "Мелёшиха",
		color: "#b3b3b3"
	},
	{
		coord: [55.0515768593443, 60.09999999999962],
		title: "Миасс",
		color: "#1e98ff"
	},
	{
		coord: [55.74195392099449, 37.58400078807857],
		title: "Москва",
		color: "#b3b3b3"
	},
	{
		coord: [68.97850309289993, 33.07234700520773],
		title: "Мурманск",
		color: "#1e98ff"
	},
	{
		coord: [55.59448093212243, 42.0307170966729],
		title: "Муром",
		color: "#1e98ff"
	},
	{
		coord: [43.49133248352449, 43.62490641276067],
		title: "Нальчик",
		color: "#b3b3b3"
	},
	{
		coord: [42.816666666667, 132.88333333333],
		title: "Находка",
		color: "#1e98ff"
	},
	{
		coord: [61.08936249247518, 72.61098632812408],
		title: "Нефтеюганск",
		color: "#1e98ff"
	},
	{
		coord: [60.928620247847434, 76.56704101562435],
		title: "Нижневартовск",
		color: "#1e98ff"
	},
	{
		coord: [55.633333333333, 51.816666666667],
		title: "Нижнекамск",
		color: "#1e98ff"
	},
	{
		coord: [56.315669659400626, 44.01239691753483],
		title: "Нижний Новгород",
		color: "#b3b3b3"
	},
	{
		coord: [57.916666666667, 59.966666666667],
		title: "Нижний Тагил",
		color: "#1e98ff"
	},
	{
		coord: [53.75976630401614, 87.13589274088437],
		title: "Новокузнецк",
		color: "#1e98ff"
	},
	{
		coord: [44.732331322715424, 37.76392008463527],
		title: "Новороссийск",
		color: "#1e98ff"
	},
	{
		coord: [55.02582260740046, 82.92183037792643],
		title: "Новосибирск",
		color: "#b3b3b3"
	},
	{
		coord: [56.116666666667, 47.5],
		title: "Новочебоксарск",
		color: "#b3b3b3"
	},
	{
		coord: [44.83019005716541, 34.9184429267493],
		title: "Новый свет",
		color: "#b3b3b3"
	},
	{
		coord: [66.07811050470575, 76.65413018261403],
		title: "Новый Уренгой",
		color: "#1e98ff"
	},
	{
		coord: [69.333333333333, 88.216666666667],
		title: "Норильск",
		color: "#1e98ff"
	},
	{
		coord: [55.1047244567908, 36.613920084635545],
		title: "Обнинск",
		color: "#1e98ff"
	},
	{
		coord: [52.96666666658649, 36.07509358723877],
		title: "Орёл",
		color: "#e6761b"
	},
	{
		coord: [51.766666666667, 55.1],
		title: "Оренбург",
		color: "#1e98ff"
	},
	{
		coord: [51.22242695661119, 58.490323893229224],
		title: "Орск",
		color: "#1e98ff"
	},
	{
		coord: [53.19670137990658, 45.016479492187216],
		title: "Пенза",
		color: "#1e98ff"
	},
	{
		coord: [56.910657160204075, 59.93626708984335],
		title: "Первоуральск",
		color: "#1e98ff"
	},
	{
		coord: [56.74061082509007, 38.839188776360594],
		title: "Переславль-Залесский",
		color: "#b3b3b3"
	},
	{
		coord: [59.928949901514436, 30.319291315428856],
		title: "Петербург",
		color: "#b3b3b3"
	},
	{
		coord: [61.779961631105145, 34.34028740917932],
		title: "Петрозаводск",
		color: "#1e98ff"
	},
	{
		coord: [53.01666666643283, 158.66098632812304],
		title: "Петропавловск-Камчатский",
		color: "#1e98ff"
	},
	{
		coord: [57.864764371933695, 47.10848151226041],
		title: "Пижма",
		color: "#1e98ff"
	},
	{
		coord: [53.89550189567622, 86.7413859049468],
		title: "Прокопьевск",
		color: "#1e98ff"
	},
	{
		coord: [57.816666666667, 28.333333333333],
		title: "Псков",
		color: "#b3b3b3"
	},
	{
		coord: [44.04306124438781, 43.05862542187116],
		title: "Пятигорск",
		color: "#b3b3b3"
	},
	{
		coord: [58.05728013793294, 38.83607991536396],
		title: "Рыбинск",
		color: "#1e98ff"
	},
	{
		coord: [54.634993355643246, 39.73589274088557],
		title: "Рязань",
		color: "#1e98ff"
	},
	{
		coord: [54.19460873031893, 45.20530598958267],
		title: "Саранск",
		color: "#1e98ff"
	},
	{
		coord: [51.54018478458441, 46.02197265624952],
		title: "Саратов",
		color: "#1e98ff"
	},
	{
		coord: [44.610791750899, 33.54088643391884],
		title: "Севастополь",
		color: "#b3b3b3"
	},
	{
		coord: [56.79557360593472, 44.495298800997595],
		title: "Семёнов",
		color: "#b3b3b3"
	},
	{
		coord: [44.948376, 34.100039],
		title: "Симферополь",
		color: "#1e98ff"
	},
	{
		coord: [43.59126703510113, 39.73401068793408],
		title: "Сочи",
		color: "#b3b3b3"
	},
	{
		coord: [45.05194692551758, 41.96410725911416],
		title: "Ставрополь",
		color: "#1e98ff"
	},
	{
		coord: [60.02393437342, 32.302323541986794],
		title: "Старая Ладога",
		color: "#1e98ff"
	},
	{
		coord: [57.99297820668938, 31.362992487299277],
		title: "Старая Русса",
		color: "#1e98ff"
	},
	{
		coord: [51.298055555556, 37.835],
		title: "Старый Оскол",
		color: "#1e98ff"
	},
	{
		coord: [53.64149477116823, 55.93901367187449],
		title: "Стерлитамак",
		color: "#1e98ff"
	},
	{
		coord: [44.85656941567625, 34.97955437694909],
		title: "Судак",
		color: "#b3b3b3"
	},
	{
		coord: [56.41621119565907, 40.45076666851196],
		title: "Суздаль",
		color: "#b3b3b3"
	},
	{
		coord: [61.25, 73.433333333333],
		title: "Сургут",
		color: "#1e98ff"
	},
	{
		coord: [53.16336546950933, 48.4584269205728],
		title: "Сызрань",
		color: "#1e98ff"
	},
	{
		coord: [61.666666666667, 50.816666666667],
		title: "Сыктывкар",
		color: "#1e98ff"
	},
	{
		coord: [58.00901819093131, 46.3311987974175],
		title: "Сява",
		color: "#1e98ff"
	},
	{
		coord: [47.24268632158093, 38.90549316406175],
		title: "Таганрог",
		color: "#1e98ff"
	},
	{
		coord: [52.72083615568737, 41.441229756672676],
		title: "Тамбов",
		color: "#1e98ff"
	},
	{
		coord: [56.85933237892814, 35.91368803168368],
		title: "Тверь",
		color: "#b3b3b3"
	},
	{
		coord: [45.29170929197612, 37.370131597713424],
		title: "Темрюк",
		color: "#b3b3b3"
	},
	{
		coord: [53.516666666667, 49.416666666667],
		title: "Тольятти",
		color: "#1e98ff"
	},
	{
		coord: [56.485571967085015, 84.9577153862826],
		title: "Томск",
		color: "#1e98ff"
	},
	{
		coord: [57.36947593361408, 46.457731662326104],
		title: "Тонкино",
		color: "#b3b3b3"
	},
	{
		coord: [57.73664127256942, 47.018187627983046],
		title: "Тоншаево",
		color: "#b3b3b3"
	},
	{
		coord: [54.19677919519043, 37.6001871744788],
		title: "Тула",
		color: "#b3b3b3"
	},
	{
		coord: [57.714048729475735, 46.6127234556205],
		title: "Туманино",
		color: "#b3b3b3"
	},
	{
		coord: [57.15, 65.533333333333],
		title: "Тюмень",
		color: "#b3b3b3"
	},
	{
		coord: [50.63572172752864, 87.94054327983437],
		title: "Улаган",
		color: "#b3b3b3"
	},
	{
		coord: [51.83673644687935, 107.57821451823092],
		title: "Улан-Удэ",
		color: "#1e98ff"
	},
	{
		coord: [54.31987807793673, 48.36666666666654],
		title: "Ульяновск",
		color: "#1e98ff"
	},
	{
		coord: [57.465149838134764, 45.79696770702537],
		title: "Урень",
		color: "#b3b3b3"
	},
	{
		coord: [43.8, 131.95],
		title: "Уссурийск",
		color: "#1e98ff"
	},
	{
		coord: [48.4833333336902, 135.05568033854442],
		title: "Хабаровск",
		color: "#1e98ff"
	},
	{
		coord: [57.66974097305426, 46.589377508354524],
		title: "Харламовцы",
		color: "#b3b3b3"
	},
	{
		coord: [57.747840453029625, 46.358664617729595],
		title: "Хмелевицы",
		color: "#b3b3b3"
	},
	{
		coord: [56.13658239300566, 47.21077080761358],
		title: "Чебоксары",
		color: "#b3b3b3"
	},
	{
		coord: [59.12177796322972, 37.89711113964651],
		title: "Череповец",
		color: "#1e98ff"
	},
	{
		coord: [57.53464461737995, 46.40878973979988],
		title: "Чёрное",
		color: "#b3b3b3"
	},
	{
		coord: [52.03672123487507, 113.48901367187499],
		title: "Чита",
		color: "#1e98ff"
	},
	{
		coord: [57.177922196768236, 46.54562228732609],
		title: "Шаранга",
		color: "#b3b3b3"
	},
	{
		coord: [47.70834289938573, 40.22234700520775],
		title: "Шахты",
		color: "#1e98ff"
	},
	{
		coord: [57.67425343154514, 46.610166965060486],
		title: "Шахунья",
		color: "#b3b3b3"
	},
	{
		coord: [51.47352820020037, 46.12215983072932],
		title: "Энгельс",
		color: "#1e98ff"
	},
	{
		coord: [46.97256487191499, 142.74431966145383],
		title: "Южно-Сахалинск",
		color: "#1e98ff"
	},
	{
		coord: [62.02206098276189, 129.70997178818948],
		title: "Якутск",
		color: "#1e98ff"
	},
	{
		coord: [44.50089628873775, 34.16450615917569],
		title: "Ялта",
		color: "#b3b3b3"
	},
	{
		coord: [57.68555828140592, 46.57324133892092],
		title: "Январи",
		color: "#b3b3b3"
	},
	{
		coord: [57.307557225464336, 47.874757013666084],
		title: "Яранск",
		color: "#b3b3b3"
	},
	{
		coord: [57.63545352182106, 39.891885375976024],
		title: "Ярославль",
		color: "#b3b3b3"
	},
	{
		coord: [61.042865024243596, 30.127030573241697],
		title: "Приозёрск",
		color: "#1e98ff"
	},
	{
		coord: [67.49938991995796, 64.06242486035079],
		title: "Воркута",
		color: "#1e98ff"
	},
	{
		coord: [64.73549685462423, 177.52372857128802],
		title: "Анадырь",
		color: "#1e98ff"
	},
	{
		coord: [59.565787327218956, 150.78987237011626],
		title: "Магадан",
		color: "#1e98ff"
	},
	{
		coord: [57.58077777059433, 34.51057549511535],
		title: "Вышний Волочек",
		color: "#b3b3b3"
	},
	{
		coord: [54.97845912258563, 73.38020440136509],
		title: "Омск",
		color: "#1e98ff"
	},
	{
		coord: [53.90597162469716, 102.04902764354988],
		title: "Зима",
		color: "#1e98ff"
	},
	{
		coord: [53.68726286846013, 88.06068535839533],
		title: "Междуреченск",
		color: "#1e98ff"
	},
	{
		coord: [62.24977499959305, 74.45686455761384],
		title: "Когалым",
		color: "#1e98ff"
	},
	{
		coord: [61.005383900763135, 69.01073571239749],
		title: "Ханты-Мансийск",
		color: "#1e98ff"
	},
	{
		coord: [58.206735521423454, 68.26057549511282],
		title: "Тобольск",
		color: "#1e98ff"
	},
	{
		coord: [58.00318630414108, 56.219559870113834],
		title: "Пермь",
		color: "#1e98ff"
	},
	{
		coord: [53.18292640180619, 50.11116143261368],
		title: "Самара",
		color: "#1e98ff"
	},
	{
		coord: [55.7264567262886, 52.407304010738336],
		title: "Набережные Челны",
		color: "#1e98ff"
	},
	{
		coord: [56.66657897845867, 43.46717949901937],
		title: "Городец",
		color: "#1e98ff"
	},
	{
		coord: [58.56014770126179, 50.02464409862858],
		title: "Кирово-Чепецк",
		color: "#1e98ff"
	},
	{
		coord: [53.96269691213659, 58.386613092769096],
		title: "Белорецк",
		color: "#1e98ff"
	},
	{
		coord: [50.08800036769891, 45.406953058589544],
		title: "Камышин",
		color: "#b3b3b3"
	},
	{
		coord: [46.30251606325239, 44.25132866894136],
		title: "Элиста",
		color: "#1e98ff"
	},
	{
		coord: [47.23850471527625, 39.71122857128507],
		title: "Ростов-на-Дону",
		color: "#1e98ff"
	},
	{
		coord: [45.03601605105906, 35.36613579784769],
		title: "Феодосия",
		color: "#1e98ff"
	},
	{
		coord: [44.099992205317456, 39.07402154003491],
		title: "Туапсе",
		color: "#1e98ff"
	},
	{
		coord: [59.604091734263505, 60.57014580761193],
		title: "Серов",
		color: "#1e98ff"
	},
	{
		coord: [64.55000867734712, 39.83345147167448],
		title: "Северодвинск",
		color: "#1e98ff"
	},
	{
		coord: [59.56718098141491, 30.110551081049287],
		title: "Гатчина",
		color: "#b3b3b3"
	},
	{
		coord: [54.79082373663104, 32.04551812206432],
		title: "Смоленск",
		color: "#1e98ff"
	},
	{
		coord: [56.02753908300817, 35.93055840526755],
		title: "Волоколамск",
		color: "#1e98ff"
	},
	{
		coord: [57.04875308952873, 34.95826836620531],
		title: "Торжок",
		color: "#1e98ff"
	},
	{
		coord: [56.92730421425982, 49.138871393548996],
		title: "Сернур",
		color: "#1e98ff"
	},
	{
		coord: [57.142938521864515, 45.15083428417394],
		title: "Красные баки",
		color: "#b3b3b3"
	},
	{
		coord: [56.02138657345332, 45.04097100292389],
		title: "Лысково",
		color: "#1e98ff"
	},
	{
		coord: [55.86107548935159, 48.3588420966739],
		title: "Волжск",
		color: "#1e98ff"
	},
	{
		coord: [55.84253515891781, 48.49067803417388],
		title: "Зеленодольск",
		color: "#1e98ff"
	},
	{
		coord: [54.841183447317555, 46.56463738475927],
		title: "Алатырь",
		color: "#1e98ff"
	},
	{
		coord: [54.92629439219197, 43.324357233392085],
		title: "Саров",
		color: "#b3b3b3"
	},
	{
		title: 'Гусь-Хрустальный',
		coord: [55.619357584106375, 40.635453424798804],
		color: "#1e98ff"
	},
	{
		coord: [51.67204909673412, 39.193497858392284],
		title: "Воронеж",
		color: "#1e98ff"
	},
	{
		coord: [50.200521453461626, 39.5642864326102],
		title: "Россошь",
		color: "#1e98ff"
	},
	{
		coord: [52.89819818707225, 40.48988457714195],
		title: "Мичуринск",
		color: "#1e98ff"
	},
	{
		coord: [56.4007935473144, 38.722115717278434],
		title: "Александров",
		description: "Это вроде столица при Иване Грозном. Прочитать День опричника\n\nhttps://ru.wikipedia.org/wiki/%D0%90%D0%BB%D0%B5%D0%BA%D1%81%D0%B0%D0%BD%D0%B4%D1%80%D0%BE%D0%B2%D1%81%D0%BA%D0%B0%D1%8F_%D1%81%D0%BB%D0%BE%D0%B1%D0%BE%D0%B4%D0%B0",
		color: "#1e98ff"
	},
	{
		coord: [55.808521477874244, 38.97102471386046],
		title: "Орехово-Зуево",
		color: "#1e98ff"
	},
	{
		coord: [56.321703462998464, 38.14155694042324],
		title: "Сергиев Посад",
		color: "#b3b3b3"
	},
	{
		coord: [56.34611508606371, 37.52632256542326],
		title: "Дмитров",
		color: "#1e98ff"
	},
	{
		coord: [55.80388093434905, 38.449174127922966],
		title: "Электросталь",
		color: "#1e98ff"
	},
	{
		coord: [56.74815687469472, 37.16926690136022],
		title: "Дубна",
		color: "#1e98ff"
	},
	{
		coord: [56.33391123452893, 36.74629326854826],
		title: "Клин",
		color: "#1e98ff"
	},
	{
		coord: [55.393333445226844, 36.740800104485636],
		title: "Наро-Фоминск",
		color: "#1e98ff"
	},
	{
		coord: [54.9104734693118, 37.40272637401667],
		title: "Серпухов",
		color: "#e6761b"
	},
	{
		coord: [54.89939510561941, 38.075638971672916],
		title: "Ступино",
		color: "#1e98ff"
	},
	{
		coord: [57.5276272413608, 38.32008477245387],
		title: "Углич",
		color: "#1e98ff"
	},
	{
		coord: [55.238263934338235, 43.096390924797966],
		title: "Ардатов",
		color: "#1e98ff"
	},
	{
		coord: [56.20706483100354, 42.714616022453896],
		title: "Гороховец",
		color: "#1e98ff"
	},
	{
		coord: [57.439240175235525, 42.16186638866485],
		title: "Кинешма",
		color: "#1e98ff"
	},
	{
		coord: [44.93465908412281, 37.98500176463927],
		title: "Крымск",
		color: "#1e98ff"
	},
	{
		coord: [45.27019792509458, 38.162156305655344],
		title: "Славянск-на-Кубани",
		color: "#1e98ff"
	},
	{
		coord: [44.64537814138087, 41.93495093365047],
		title: "Невинномысск",
		color: "#1e98ff"
	},
	{
		coord: [44.247939980729214, 42.05168066997864],
		title: "Черкесск",
		color: "#1e98ff"
	},
	{
		coord: [43.359284763331445, 46.08984290142387],
		title: "Гудермес",
		color: "#1e98ff"
	},
	{
		coord: [44.22621914190933, 43.21623145122834],
		title: "Минеральные воды",
		color: "#1e98ff"
	},
	{
		coord: [44.16298534204965, 43.484023199275306],
		title: "Георгиевск",
		color: "#1e98ff"
	},
	{
		coord: [42.816666666667, 132.88333333333],
		title: "Находка",
		color: "#1e98ff"
	},
	{
		coord: [43.674905573749086, 40.190507135738095],
		title: "Красная поляна",
		color: "#1e98ff"
	},
	{
		coord: [44.038603453691366, 145.85701104198938],
		title: "Южно-Курильск",
		color: "#1e98ff"
	},
	{
		coord: [44.57474695439019, 38.08561621685408],
		title: "Геленджик",
		color: "#1e98ff"
	},
	{
		coord: [45.618690931662044, 38.93978234325289],
		title: "Тимашевск",
		color: "#1e98ff"
	},
	{
		coord: [50.091092736256485, 118.03413506542623],
		title: "Краснокаменск",
		color: "#1e98ff"
	},
	{
		coord: [50.6, 36.6],
		title: "Бердск",
		color: "#1e98ff"
	},
	{
		coord: [51.37263244230271, 42.08290215526644],
		title: "Борисоглебск",
		color: "#1e98ff"
	},
	{
		coord: [52.75679113956555, 32.229539118157064],
		title: "Клинцы",
		color: "#1e98ff"
	},
	{
		coord: [53.95176306493229, 32.85850640331442],
		title: "Рославль",
		color: "#1e98ff"
	},
	{
		coord: [54.73603064146393, 55.95039483105071],
		title: "Уфа",
		color: "#1e98ff"
	},
	{
		coord: [54.7678038311424, 38.869401178703505],
		title: "Зарайск",
		color: "#b3b3b3"
	},
	{
		coord: [54.94369019207235, 41.384583673821936],
		title: "Касимов",
		color: "#1e98ff"
	},
	{
		coord: [55.17386474923574, 61.41883965526857],
		title: "Челябинск",
		color: "#1e98ff"
	},
	{
		coord: [55.238263934338235, 43.096390924797966],
		title: "Ардатов",
		color: "#1e98ff"
	},
	{
		coord: [55.39740394351705, 43.8164794921864],
		title: "Арзамас",
		color: "#b3b3b3"
	},
	{
		coord: [55.41833803557579, 78.3240520576142],
		title: "Куйбышев",
		color: "#1e98ff"
	},
	{
		coord: [55.518197572114815, 45.44746514354838],
		title: "Сергач",
		color: "#1e98ff"
	},
	{
		coord: [55.619357584106375, 40.635453424798804],
		title: "Гусь-Хрустальный",
		color: "#1e98ff"
	},
	{
		coord: [55.63800467580822, 109.32060357128654],
		title: "Северобайкальск",
		color: "#1e98ff"
	},
	{
		coord: [56.074117596583, 54.24450683593627],
		title: "Нефтекамск",
		color: "#1e98ff"
	},
	{
		coord: [56.26671996207004, 34.30732842479926],
		title: "Ржев",
		color: "#1e98ff"
	},
	{
		coord: [56.33391123452893, 36.74629326854826],
		title: "Клин",
		color: "#1e98ff"
	},
	{
		coord: [56.34001364995226, 46.56257744823536],
		title: "Козьмодемьянск",
		color: "#1e98ff"
	},
	{
		coord: [56.34611508606371, 37.52632256542326],
		title: "Дмитров",
		color: "#b3b3b3"
	},
	{
		coord: [56.34611508645557, 30.52803154979929],
		title: "Великие Луки",
		color: "#1e98ff"
	},
	{
		coord: [56.781624115260556, 46.86266242046284],
		title: "Килемары",
		color: "#b3b3b3"
	},
	{
		coord: [57.66274972275892, 46.54131232280765],
		title: "Лужайки",
		color: "#b3b3b3"
	},
	{
		coord: [57.700725352189615, 46.29137335796385],
		title: "Большая свеча",
		color: "#b3b3b3"
	},
	{
		coord: [57.864764371933695, 47.10848151226041],
		title: "Пижма",
		color: "#b3b3b3"
	},
	{
		coord: [57.96087659097582, 46.682761297417485],
		title: "Вахтан",
		color: "#b3b3b3"
	},
	{
		coord: [58.00901819093131, 46.3311987974175],
		title: "Сява",
		color: "#b3b3b3"
	},
	{
		coord: [58.30698905194736, 48.344422541009706],
		title: "Котельнич",
		color: "#1e98ff"
	},
	{
		coord: [61.25260138898956, 46.62162896191177],
		title: "Котлас",
		color: "#1e98ff"
	},
	{
		coord: [64.53345061967224, 40.5113606770827],
		title: "Архангельск",
		color: "#1e98ff"
	},
	{
		coord: [56.20936098522962, 86.43864735885775],
		title: "Яя",
		color: "#1e98ff"
	},
	{
		coord: [61.00955066419829, 36.44828911815842],
		title: "Вытегра",
		color: "#1e98ff"
	},
	{
		coord: [55.978676424910404, 43.06413947124643],
		title: "Павлово",
		color: "#1e98ff"
	},
	{
		coord: [57.971093873486055, 33.24714776074029],
		title: "Валдай",
		color: "#1e98ff"
	},
	{
		coord: [57.81899311779919, 29.962235651365184],
		title: "Дно",
		color: "#1e98ff"
	},
	{
		coord: [59.37010346433971, 28.59993096386494],
		title: "Кингисепп",
		color: "#1e98ff"
	},
	{
		coord: [54.851941, 83.101889],
		title: "Академгородок",
		color: "#b3b3b3"
	},
	{
		coord: [55.77811915895416, 38.651042692144486],
		title: "Павловский Посад",
		color: "#1e98ff"
	},
	{
		coord: [55.84539737271209, 38.20060323901948],
		title: "Монино",
		color: "#1e98ff"
	},
	{
		coord: [56.49431016883911, 39.682384244878726],
		title: "Юрьев Польский",
		color: "#1e98ff"
	},
	{
		coord: [57.25974064730775, 39.13856100269115],
		title: "Борисоглебский",
		color: "#1e98ff"
	},
	{
		coord: [57.30585100214604, 39.542308561284905],
		title: "Семибратово",
		color: "#1e98ff"
	},
	{
		coord: [57.198666874613295, 39.42420553394114],
		title: "Ростов",
		color: "#1e98ff"
	},
	{
		coord: [57.24634290585394, 37.86689352222236],
		title: "Клязин",
		color: "#1e98ff"
	},
	{
		coord: [56.975859747574304, 37.51533102222235],
		title: "Белый городок",
		color: "#1e98ff"
	},
	{
		coord: [56.55654936616978, 40.14655660815973],
		title: "Гаврилов Посад",
		color: "#1e98ff"
	},
	{
		coord: [56.812014160536506, 41.86866354175342],
		title: "Палех",
		color: "#1e98ff"
	},
	{
		coord: [56.86319939357897, 41.37427877612841],
		title: "Шуя",
		color: "#1e98ff"
	},
	{
		coord: [54.749725, 35.600477],
		title: 'Никола-Ленивец',
		description: "Россия, Калужская область, Дзержинский район, деревня Никола-Ленивец",
		color: "#e6761b"
	},
	{
		coord: [54.708149, 40.857257],
		title: "Окский государственный природный биосферный заповедник",
		description: "Лесопарк, заповедник; </br>\nРоссия, Рязанская область, Спасский район, посёлок Брыкин Бор",
		color: "#1e98ff"
	},
	{
		coord: [55.629946198336555, 36.98955451586885],
		title: "Большие Вяземы",
		color: "#b3b3b3"
	},
	{
		coord: [58.74052154909886, 27.82727728390801],
		title: "Гдов",
		color: "#1e98ff"
	},
	{
		coord: [59.371505240309574, 28.20081244015801],
		title: "Нарва",
		color: "#1e98ff"
	},
	{
		coord: [63.911595643971694, 38.08301458859511],
		title: "Онега",
		color: "#1e98ff"
	},
	{
		coord: [60.75252431742595, 46.300788026095034],
		title: "Великий устюг",
		color: "#1e98ff"
	},
	{
		coord: [57.70816867275807, 27.859549622773898],
		title: "Изборск",
		color: "#b3b3b3"
	},
	{
		coord: [59.934943, 31.026597],
		description: "Россия, Ленинградская область, Кировский район, ",
		title: "Шлиссельбург",
		color: "#1e98ff"
	},
	{
		coord: [59.974581, 31.034961],
		description: "Россия, Ленинградская область, Всеволожский район, Морозовское городское поселение, городской ",
		title: "посёлок имени Морозова",
		color: "#b3b3b3"
	},
	{
		coord: [43.442356226237145, 39.93039130316834],
		title: "Адлер",
		color: "#b3b3b3"
	},
	{
		coord: [59.99384169594978, 29.768932016207298],
		title: "Кронштадт",
		color: "#b3b3b3"
	},
	{
		coord: [41.283713, 47.833798],
		title: "Куруш",
		color: "#b3b3b3"
	},
	{
		coord: [42.432525, 46.570209],
		title: "Гоор",
		color: "#b3b3b3"
	},
	{
		coord: [42.302819, 46.99637],
		title: "Гамсутль",
		color: "#b3b3b3"
	},
	{
		coord: [42.543723, 46.7059],
		title: "Хунзах",
		color: "#b3b3b3"
	},
	{
		coord: [42.667186, 46.211054],
		title: "Ботлих",
		color: "#b3b3b3"
	},
	{
		coord: [43.153444, 45.903956],
		title: "Шали",
		color: "#b3b3b3"
	},
	{
		coord: [43.292662, 45.867439],
		title: "Аргун",
		color: "#b3b3b3"
	},
	{
		coord: [43.15983, 40.89901],
		title: "Абхазия",
		color: "#b3b3b3"
	},
	{
		coord: [54.960075, 20.47504],
		title: "Зеленоградск",
		color: "#b3b3b3"
	},
	{
		coord: [55.830594, 46.079496],
		title: "Курмыш",
		color: "#b3b3b3"
	},
	{
		coord: [44.498056, 33.489016],
		title: "Мыс Фиолент",
		color: "#b3b3b3"
	},
	{
		coord: [44.61079430587495, 33.492792550292755],
		title: "Херсонес Таврический",
		color: "#b3b3b3"
	},
	{
		coord: [59.881227, 29.906775],
		title: "Петергоф",
		color: "#b3b3b3"
	},
	{
		coord: [54.944218, 20.156075],
		title: "Светлогорск",
		color: "#b3b3b3"
	},
	{
		coord: [44.948237, 34.100327],
		title: 'Симферополь',
		description: "Россия, Республика Крым, Симферополь",
		color: "#b3b3b3"
	},
	{
		coord: [59.722336, 30.416767],
		title: "Пушкин",
		color: "#b3b3b3"
	},
	{
		coord: [55.11933957534902, 38.75983794203472],
		title: "Бобренев монастырь",
		color: "#b3b3b3"
	},
	{
		coord: [59.953801134716585, 31.038487749010805],
		title: "Орешек",
		color: "#b3b3b3"
	},
	{
		coord: [42.543723, 46.7059],
		title: 'Хунзах',
		description: "Россия, Республика Дагестан, село Хунзах",
		color: "#b3b3b3"
	},
	{
		coord: [42.772359, 46.15205],
		title: "Озеро Казеной-Ам",
		description: "Достопримечательность; </br>\nРоссия, озеро Кезенойам",
		color: "#b3b3b3"
	},
	{
		coord: [43.265208, 44.446071],
		title: 'Брут',
		description: "Россия, Республика Северная Осетия — Алания, Правобережный район, село Брут",
		color: "#b3b3b3"
	},
	{
		coord: [42.432525, 46.570209],
		title: 'село Гоор',
		description: "Россия, Республика Дагестан, Шамильский район, село Гоор",
		color: "#b3b3b3"
	},
	{
		coord: [42.42936967217622, 46.56599793184606],
		title: "Старый Гоор",
		color: "#b3b3b3"
	},
	{
		coord: [42.302819, 46.99637],
		title: 'Гамсутль',
		description: "Россия, Республика Дагестан, Гунибский район, село Гамсутль",
		color: "#b3b3b3"
	},
	{
		coord: [43.289164703390256, 40.269239586943996],
		title: "Гагра",
		color: "#b3b3b3"
	},
	{
		coord: [43.47196960362603, 40.53428475295962],
		title: "Рица",
		color: "#b3b3b3"
	},
	{
		coord: [58.35718960287569, 45.52919684429246],
		title: "Шарья",
		color: "#b3b3b3"
	},
	{
		coord: [52.368044370029025, 38.76715479869723],
		title: "парк Кудыкина гора",
		color: "#b3b3b3"
	},
	{
		coord: [55.636239, 37.212621],
		title: "Лесной Городок",
		color: "#b3b3b3"
	}
]